----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 24, 112, 112]             648
       BatchNorm2d-2         [-1, 24, 112, 112]              48
              SiLU-3         [-1, 24, 112, 112]               0
            Conv2d-4         [-1, 24, 112, 112]           5,184
       BatchNorm2d-5         [-1, 24, 112, 112]              48
              SiLU-6         [-1, 24, 112, 112]               0
 AdaptiveAvgPool2d-7             [-1, 24, 1, 1]               0
            Linear-8                    [-1, 6]             150
              SiLU-9                    [-1, 6]               0
           Linear-10                   [-1, 24]             168
          Sigmoid-11                   [-1, 24]               0
          SEBlock-12         [-1, 24, 112, 112]               0
           Conv2d-13         [-1, 24, 112, 112]             576
      BatchNorm2d-14         [-1, 24, 112, 112]              48
         Identity-15         [-1, 24, 112, 112]               0
 FusedMBConvBlock-16         [-1, 24, 112, 112]               0
           Conv2d-17         [-1, 24, 112, 112]           5,184
      BatchNorm2d-18         [-1, 24, 112, 112]              48
             SiLU-19         [-1, 24, 112, 112]               0
AdaptiveAvgPool2d-20             [-1, 24, 1, 1]               0
           Linear-21                    [-1, 6]             150
             SiLU-22                    [-1, 6]               0
           Linear-23                   [-1, 24]             168
          Sigmoid-24                   [-1, 24]               0
          SEBlock-25         [-1, 24, 112, 112]               0
           Conv2d-26         [-1, 24, 112, 112]             576
      BatchNorm2d-27         [-1, 24, 112, 112]              48
         Identity-28         [-1, 24, 112, 112]               0
 FusedMBConvBlock-29         [-1, 24, 112, 112]               0
           Conv2d-30           [-1, 96, 56, 56]          20,736
      BatchNorm2d-31           [-1, 96, 56, 56]             192
             SiLU-32           [-1, 96, 56, 56]               0
AdaptiveAvgPool2d-33             [-1, 96, 1, 1]               0
           Linear-34                   [-1, 24]           2,328
             SiLU-35                   [-1, 24]               0
           Linear-36                   [-1, 96]           2,400
          Sigmoid-37                   [-1, 96]               0
          SEBlock-38           [-1, 96, 56, 56]               0
           Conv2d-39           [-1, 48, 56, 56]           4,608
      BatchNorm2d-40           [-1, 48, 56, 56]              96
           Conv2d-41           [-1, 48, 56, 56]           1,152
      BatchNorm2d-42           [-1, 48, 56, 56]              96
 FusedMBConvBlock-43           [-1, 48, 56, 56]               0
           Conv2d-44          [-1, 192, 56, 56]          82,944
      BatchNorm2d-45          [-1, 192, 56, 56]             384
             SiLU-46          [-1, 192, 56, 56]               0
AdaptiveAvgPool2d-47            [-1, 192, 1, 1]               0
           Linear-48                   [-1, 48]           9,264
             SiLU-49                   [-1, 48]               0
           Linear-50                  [-1, 192]           9,408
          Sigmoid-51                  [-1, 192]               0
          SEBlock-52          [-1, 192, 56, 56]               0
           Conv2d-53           [-1, 48, 56, 56]           9,216
      BatchNorm2d-54           [-1, 48, 56, 56]              96
         Identity-55           [-1, 48, 56, 56]               0
 FusedMBConvBlock-56           [-1, 48, 56, 56]               0
           Conv2d-57          [-1, 192, 56, 56]          82,944
      BatchNorm2d-58          [-1, 192, 56, 56]             384
             SiLU-59          [-1, 192, 56, 56]               0
AdaptiveAvgPool2d-60            [-1, 192, 1, 1]               0
           Linear-61                   [-1, 48]           9,264
             SiLU-62                   [-1, 48]               0
           Linear-63                  [-1, 192]           9,408
          Sigmoid-64                  [-1, 192]               0
          SEBlock-65          [-1, 192, 56, 56]               0
           Conv2d-66           [-1, 48, 56, 56]           9,216
      BatchNorm2d-67           [-1, 48, 56, 56]              96
         Identity-68           [-1, 48, 56, 56]               0
 FusedMBConvBlock-69           [-1, 48, 56, 56]               0
           Conv2d-70          [-1, 192, 56, 56]          82,944
      BatchNorm2d-71          [-1, 192, 56, 56]             384
             SiLU-72          [-1, 192, 56, 56]               0
AdaptiveAvgPool2d-73            [-1, 192, 1, 1]               0
           Linear-74                   [-1, 48]           9,264
             SiLU-75                   [-1, 48]               0
           Linear-76                  [-1, 192]           9,408
          Sigmoid-77                  [-1, 192]               0
          SEBlock-78          [-1, 192, 56, 56]               0
           Conv2d-79           [-1, 48, 56, 56]           9,216
      BatchNorm2d-80           [-1, 48, 56, 56]              96
         Identity-81           [-1, 48, 56, 56]               0
 FusedMBConvBlock-82           [-1, 48, 56, 56]               0
           Conv2d-83          [-1, 192, 28, 28]          82,944
      BatchNorm2d-84          [-1, 192, 28, 28]             384
             SiLU-85          [-1, 192, 28, 28]               0
AdaptiveAvgPool2d-86            [-1, 192, 1, 1]               0
           Linear-87                   [-1, 48]           9,264
             SiLU-88                   [-1, 48]               0
           Linear-89                  [-1, 192]           9,408
          Sigmoid-90                  [-1, 192]               0
          SEBlock-91          [-1, 192, 28, 28]               0
           Conv2d-92           [-1, 64, 28, 28]          12,288
      BatchNorm2d-93           [-1, 64, 28, 28]             128
           Conv2d-94           [-1, 64, 28, 28]           3,072
      BatchNorm2d-95           [-1, 64, 28, 28]             128
 FusedMBConvBlock-96           [-1, 64, 28, 28]               0
           Conv2d-97          [-1, 256, 28, 28]         147,456
      BatchNorm2d-98          [-1, 256, 28, 28]             512
             SiLU-99          [-1, 256, 28, 28]               0
AdaptiveAvgPool2d-100            [-1, 256, 1, 1]               0
          Linear-101                   [-1, 64]          16,448
            SiLU-102                   [-1, 64]               0
          Linear-103                  [-1, 256]          16,640
         Sigmoid-104                  [-1, 256]               0
         SEBlock-105          [-1, 256, 28, 28]               0
          Conv2d-106           [-1, 64, 28, 28]          16,384
     BatchNorm2d-107           [-1, 64, 28, 28]             128
        Identity-108           [-1, 64, 28, 28]               0
FusedMBConvBlock-109           [-1, 64, 28, 28]               0
          Conv2d-110          [-1, 256, 28, 28]         147,456
     BatchNorm2d-111          [-1, 256, 28, 28]             512
            SiLU-112          [-1, 256, 28, 28]               0
AdaptiveAvgPool2d-113            [-1, 256, 1, 1]               0
          Linear-114                   [-1, 64]          16,448
            SiLU-115                   [-1, 64]               0
          Linear-116                  [-1, 256]          16,640
         Sigmoid-117                  [-1, 256]               0
         SEBlock-118          [-1, 256, 28, 28]               0
          Conv2d-119           [-1, 64, 28, 28]          16,384
     BatchNorm2d-120           [-1, 64, 28, 28]             128
        Identity-121           [-1, 64, 28, 28]               0
FusedMBConvBlock-122           [-1, 64, 28, 28]               0
          Conv2d-123          [-1, 256, 28, 28]         147,456
     BatchNorm2d-124          [-1, 256, 28, 28]             512
            SiLU-125          [-1, 256, 28, 28]               0
AdaptiveAvgPool2d-126            [-1, 256, 1, 1]               0
          Linear-127                   [-1, 64]          16,448
            SiLU-128                   [-1, 64]               0
          Linear-129                  [-1, 256]          16,640
         Sigmoid-130                  [-1, 256]               0
         SEBlock-131          [-1, 256, 28, 28]               0
          Conv2d-132           [-1, 64, 28, 28]          16,384
     BatchNorm2d-133           [-1, 64, 28, 28]             128
        Identity-134           [-1, 64, 28, 28]               0
FusedMBConvBlock-135           [-1, 64, 28, 28]               0
          Conv2d-136          [-1, 256, 28, 28]          16,384
     BatchNorm2d-137          [-1, 256, 28, 28]             512
            SiLU-138          [-1, 256, 28, 28]               0
          Conv2d-139          [-1, 256, 14, 14]           2,304
     BatchNorm2d-140          [-1, 256, 14, 14]             512
            SiLU-141          [-1, 256, 14, 14]               0
AdaptiveAvgPool2d-142            [-1, 256, 1, 1]               0
          Linear-143                   [-1, 64]          16,448
            SiLU-144                   [-1, 64]               0
          Linear-145                  [-1, 256]          16,640
         Sigmoid-146                  [-1, 256]               0
         SEBlock-147          [-1, 256, 14, 14]               0
          Conv2d-148          [-1, 128, 14, 14]          32,768
     BatchNorm2d-149          [-1, 128, 14, 14]             256
          Conv2d-150          [-1, 128, 14, 14]           8,192
     BatchNorm2d-151          [-1, 128, 14, 14]             256
     MBConvBlock-152          [-1, 128, 14, 14]               0
          Conv2d-153          [-1, 512, 14, 14]          65,536
     BatchNorm2d-154          [-1, 512, 14, 14]           1,024
            SiLU-155          [-1, 512, 14, 14]               0
          Conv2d-156          [-1, 512, 14, 14]           4,608
     BatchNorm2d-157          [-1, 512, 14, 14]           1,024
            SiLU-158          [-1, 512, 14, 14]               0
AdaptiveAvgPool2d-159            [-1, 512, 1, 1]               0
          Linear-160                  [-1, 128]          65,664
            SiLU-161                  [-1, 128]               0
          Linear-162                  [-1, 512]          66,048
         Sigmoid-163                  [-1, 512]               0
         SEBlock-164          [-1, 512, 14, 14]               0
          Conv2d-165          [-1, 128, 14, 14]          65,536
     BatchNorm2d-166          [-1, 128, 14, 14]             256
        Identity-167          [-1, 128, 14, 14]               0
     MBConvBlock-168          [-1, 128, 14, 14]               0
          Conv2d-169          [-1, 512, 14, 14]          65,536
     BatchNorm2d-170          [-1, 512, 14, 14]           1,024
            SiLU-171          [-1, 512, 14, 14]               0
          Conv2d-172          [-1, 512, 14, 14]           4,608
     BatchNorm2d-173          [-1, 512, 14, 14]           1,024
            SiLU-174          [-1, 512, 14, 14]               0
AdaptiveAvgPool2d-175            [-1, 512, 1, 1]               0
          Linear-176                  [-1, 128]          65,664
            SiLU-177                  [-1, 128]               0
          Linear-178                  [-1, 512]          66,048
         Sigmoid-179                  [-1, 512]               0
         SEBlock-180          [-1, 512, 14, 14]               0
          Conv2d-181          [-1, 128, 14, 14]          65,536
     BatchNorm2d-182          [-1, 128, 14, 14]             256
        Identity-183          [-1, 128, 14, 14]               0
     MBConvBlock-184          [-1, 128, 14, 14]               0
          Conv2d-185          [-1, 512, 14, 14]          65,536
     BatchNorm2d-186          [-1, 512, 14, 14]           1,024
            SiLU-187          [-1, 512, 14, 14]               0
          Conv2d-188          [-1, 512, 14, 14]           4,608
     BatchNorm2d-189          [-1, 512, 14, 14]           1,024
            SiLU-190          [-1, 512, 14, 14]               0
AdaptiveAvgPool2d-191            [-1, 512, 1, 1]               0
          Linear-192                  [-1, 128]          65,664
            SiLU-193                  [-1, 128]               0
          Linear-194                  [-1, 512]          66,048
         Sigmoid-195                  [-1, 512]               0
         SEBlock-196          [-1, 512, 14, 14]               0
          Conv2d-197          [-1, 128, 14, 14]          65,536
     BatchNorm2d-198          [-1, 128, 14, 14]             256
        Identity-199          [-1, 128, 14, 14]               0
     MBConvBlock-200          [-1, 128, 14, 14]               0
          Conv2d-201          [-1, 512, 14, 14]          65,536
     BatchNorm2d-202          [-1, 512, 14, 14]           1,024
            SiLU-203          [-1, 512, 14, 14]               0
          Conv2d-204          [-1, 512, 14, 14]           4,608
     BatchNorm2d-205          [-1, 512, 14, 14]           1,024
            SiLU-206          [-1, 512, 14, 14]               0
AdaptiveAvgPool2d-207            [-1, 512, 1, 1]               0
          Linear-208                  [-1, 128]          65,664
            SiLU-209                  [-1, 128]               0
          Linear-210                  [-1, 512]          66,048
         Sigmoid-211                  [-1, 512]               0
         SEBlock-212          [-1, 512, 14, 14]               0
          Conv2d-213          [-1, 128, 14, 14]          65,536
     BatchNorm2d-214          [-1, 128, 14, 14]             256
        Identity-215          [-1, 128, 14, 14]               0
     MBConvBlock-216          [-1, 128, 14, 14]               0
          Conv2d-217          [-1, 512, 14, 14]          65,536
     BatchNorm2d-218          [-1, 512, 14, 14]           1,024
            SiLU-219          [-1, 512, 14, 14]               0
          Conv2d-220          [-1, 512, 14, 14]           4,608
     BatchNorm2d-221          [-1, 512, 14, 14]           1,024
            SiLU-222          [-1, 512, 14, 14]               0
AdaptiveAvgPool2d-223            [-1, 512, 1, 1]               0
          Linear-224                  [-1, 128]          65,664
            SiLU-225                  [-1, 128]               0
          Linear-226                  [-1, 512]          66,048
         Sigmoid-227                  [-1, 512]               0
         SEBlock-228          [-1, 512, 14, 14]               0
          Conv2d-229          [-1, 128, 14, 14]          65,536
     BatchNorm2d-230          [-1, 128, 14, 14]             256
        Identity-231          [-1, 128, 14, 14]               0
     MBConvBlock-232          [-1, 128, 14, 14]               0
          Conv2d-233          [-1, 768, 14, 14]          98,304
     BatchNorm2d-234          [-1, 768, 14, 14]           1,536
            SiLU-235          [-1, 768, 14, 14]               0
          Conv2d-236          [-1, 768, 14, 14]           6,912
     BatchNorm2d-237          [-1, 768, 14, 14]           1,536
            SiLU-238          [-1, 768, 14, 14]               0
AdaptiveAvgPool2d-239            [-1, 768, 1, 1]               0
          Linear-240                  [-1, 192]         147,648
            SiLU-241                  [-1, 192]               0
          Linear-242                  [-1, 768]         148,224
         Sigmoid-243                  [-1, 768]               0
         SEBlock-244          [-1, 768, 14, 14]               0
          Conv2d-245          [-1, 160, 14, 14]         122,880
     BatchNorm2d-246          [-1, 160, 14, 14]             320
          Conv2d-247          [-1, 160, 14, 14]          20,480
     BatchNorm2d-248          [-1, 160, 14, 14]             320
     MBConvBlock-249          [-1, 160, 14, 14]               0
          Conv2d-250          [-1, 960, 14, 14]         153,600
     BatchNorm2d-251          [-1, 960, 14, 14]           1,920
            SiLU-252          [-1, 960, 14, 14]               0
          Conv2d-253          [-1, 960, 14, 14]           8,640
     BatchNorm2d-254          [-1, 960, 14, 14]           1,920
            SiLU-255          [-1, 960, 14, 14]               0
AdaptiveAvgPool2d-256            [-1, 960, 1, 1]               0
          Linear-257                  [-1, 240]         230,640
            SiLU-258                  [-1, 240]               0
          Linear-259                  [-1, 960]         231,360
         Sigmoid-260                  [-1, 960]               0
         SEBlock-261          [-1, 960, 14, 14]               0
          Conv2d-262          [-1, 160, 14, 14]         153,600
     BatchNorm2d-263          [-1, 160, 14, 14]             320
        Identity-264          [-1, 160, 14, 14]               0
     MBConvBlock-265          [-1, 160, 14, 14]               0
          Conv2d-266          [-1, 960, 14, 14]         153,600
     BatchNorm2d-267          [-1, 960, 14, 14]           1,920
            SiLU-268          [-1, 960, 14, 14]               0
          Conv2d-269          [-1, 960, 14, 14]           8,640
     BatchNorm2d-270          [-1, 960, 14, 14]           1,920
            SiLU-271          [-1, 960, 14, 14]               0
AdaptiveAvgPool2d-272            [-1, 960, 1, 1]               0
          Linear-273                  [-1, 240]         230,640
            SiLU-274                  [-1, 240]               0
          Linear-275                  [-1, 960]         231,360
         Sigmoid-276                  [-1, 960]               0
         SEBlock-277          [-1, 960, 14, 14]               0
          Conv2d-278          [-1, 160, 14, 14]         153,600
     BatchNorm2d-279          [-1, 160, 14, 14]             320
        Identity-280          [-1, 160, 14, 14]               0
     MBConvBlock-281          [-1, 160, 14, 14]               0
          Conv2d-282          [-1, 960, 14, 14]         153,600
     BatchNorm2d-283          [-1, 960, 14, 14]           1,920
            SiLU-284          [-1, 960, 14, 14]               0
          Conv2d-285          [-1, 960, 14, 14]           8,640
     BatchNorm2d-286          [-1, 960, 14, 14]           1,920
            SiLU-287          [-1, 960, 14, 14]               0
AdaptiveAvgPool2d-288            [-1, 960, 1, 1]               0
          Linear-289                  [-1, 240]         230,640
            SiLU-290                  [-1, 240]               0
          Linear-291                  [-1, 960]         231,360
         Sigmoid-292                  [-1, 960]               0
         SEBlock-293          [-1, 960, 14, 14]               0
          Conv2d-294          [-1, 160, 14, 14]         153,600
     BatchNorm2d-295          [-1, 160, 14, 14]             320
        Identity-296          [-1, 160, 14, 14]               0
     MBConvBlock-297          [-1, 160, 14, 14]               0
          Conv2d-298          [-1, 960, 14, 14]         153,600
     BatchNorm2d-299          [-1, 960, 14, 14]           1,920
            SiLU-300          [-1, 960, 14, 14]               0
          Conv2d-301          [-1, 960, 14, 14]           8,640
     BatchNorm2d-302          [-1, 960, 14, 14]           1,920
            SiLU-303          [-1, 960, 14, 14]               0
AdaptiveAvgPool2d-304            [-1, 960, 1, 1]               0
          Linear-305                  [-1, 240]         230,640
            SiLU-306                  [-1, 240]               0
          Linear-307                  [-1, 960]         231,360
         Sigmoid-308                  [-1, 960]               0
         SEBlock-309          [-1, 960, 14, 14]               0
          Conv2d-310          [-1, 160, 14, 14]         153,600
     BatchNorm2d-311          [-1, 160, 14, 14]             320
        Identity-312          [-1, 160, 14, 14]               0
     MBConvBlock-313          [-1, 160, 14, 14]               0
          Conv2d-314          [-1, 960, 14, 14]         153,600
     BatchNorm2d-315          [-1, 960, 14, 14]           1,920
            SiLU-316          [-1, 960, 14, 14]               0
          Conv2d-317          [-1, 960, 14, 14]           8,640
     BatchNorm2d-318          [-1, 960, 14, 14]           1,920
            SiLU-319          [-1, 960, 14, 14]               0
AdaptiveAvgPool2d-320            [-1, 960, 1, 1]               0
          Linear-321                  [-1, 240]         230,640
            SiLU-322                  [-1, 240]               0
          Linear-323                  [-1, 960]         231,360
         Sigmoid-324                  [-1, 960]               0
         SEBlock-325          [-1, 960, 14, 14]               0
          Conv2d-326          [-1, 160, 14, 14]         153,600
     BatchNorm2d-327          [-1, 160, 14, 14]             320
        Identity-328          [-1, 160, 14, 14]               0
     MBConvBlock-329          [-1, 160, 14, 14]               0
          Conv2d-330          [-1, 960, 14, 14]         153,600
     BatchNorm2d-331          [-1, 960, 14, 14]           1,920
            SiLU-332          [-1, 960, 14, 14]               0
          Conv2d-333          [-1, 960, 14, 14]           8,640
     BatchNorm2d-334          [-1, 960, 14, 14]           1,920
            SiLU-335          [-1, 960, 14, 14]               0
AdaptiveAvgPool2d-336            [-1, 960, 1, 1]               0
          Linear-337                  [-1, 240]         230,640
            SiLU-338                  [-1, 240]               0
          Linear-339                  [-1, 960]         231,360
         Sigmoid-340                  [-1, 960]               0
         SEBlock-341          [-1, 960, 14, 14]               0
          Conv2d-342          [-1, 160, 14, 14]         153,600
     BatchNorm2d-343          [-1, 160, 14, 14]             320
        Identity-344          [-1, 160, 14, 14]               0
     MBConvBlock-345          [-1, 160, 14, 14]               0
          Conv2d-346          [-1, 960, 14, 14]         153,600
     BatchNorm2d-347          [-1, 960, 14, 14]           1,920
            SiLU-348          [-1, 960, 14, 14]               0
          Conv2d-349          [-1, 960, 14, 14]           8,640
     BatchNorm2d-350          [-1, 960, 14, 14]           1,920
            SiLU-351          [-1, 960, 14, 14]               0
AdaptiveAvgPool2d-352            [-1, 960, 1, 1]               0
          Linear-353                  [-1, 240]         230,640
            SiLU-354                  [-1, 240]               0
          Linear-355                  [-1, 960]         231,360
         Sigmoid-356                  [-1, 960]               0
         SEBlock-357          [-1, 960, 14, 14]               0
          Conv2d-358          [-1, 160, 14, 14]         153,600
     BatchNorm2d-359          [-1, 160, 14, 14]             320
        Identity-360          [-1, 160, 14, 14]               0
     MBConvBlock-361          [-1, 160, 14, 14]               0
          Conv2d-362          [-1, 960, 14, 14]         153,600
     BatchNorm2d-363          [-1, 960, 14, 14]           1,920
            SiLU-364          [-1, 960, 14, 14]               0
          Conv2d-365          [-1, 960, 14, 14]           8,640
     BatchNorm2d-366          [-1, 960, 14, 14]           1,920
            SiLU-367          [-1, 960, 14, 14]               0
AdaptiveAvgPool2d-368            [-1, 960, 1, 1]               0
          Linear-369                  [-1, 240]         230,640
            SiLU-370                  [-1, 240]               0
          Linear-371                  [-1, 960]         231,360
         Sigmoid-372                  [-1, 960]               0
         SEBlock-373          [-1, 960, 14, 14]               0
          Conv2d-374          [-1, 160, 14, 14]         153,600
     BatchNorm2d-375          [-1, 160, 14, 14]             320
        Identity-376          [-1, 160, 14, 14]               0
     MBConvBlock-377          [-1, 160, 14, 14]               0
          Conv2d-378          [-1, 960, 14, 14]         153,600
     BatchNorm2d-379          [-1, 960, 14, 14]           1,920
            SiLU-380          [-1, 960, 14, 14]               0
          Conv2d-381            [-1, 960, 7, 7]           8,640
     BatchNorm2d-382            [-1, 960, 7, 7]           1,920
            SiLU-383            [-1, 960, 7, 7]               0
AdaptiveAvgPool2d-384            [-1, 960, 1, 1]               0
          Linear-385                  [-1, 240]         230,640
            SiLU-386                  [-1, 240]               0
          Linear-387                  [-1, 960]         231,360
         Sigmoid-388                  [-1, 960]               0
         SEBlock-389            [-1, 960, 7, 7]               0
          Conv2d-390            [-1, 256, 7, 7]         245,760
     BatchNorm2d-391            [-1, 256, 7, 7]             512
          Conv2d-392            [-1, 256, 7, 7]          40,960
     BatchNorm2d-393            [-1, 256, 7, 7]             512
     MBConvBlock-394            [-1, 256, 7, 7]               0
          Conv2d-395           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-396           [-1, 1536, 7, 7]           3,072
            SiLU-397           [-1, 1536, 7, 7]               0
          Conv2d-398           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-399           [-1, 1536, 7, 7]           3,072
            SiLU-400           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-401           [-1, 1536, 1, 1]               0
          Linear-402                  [-1, 384]         590,208
            SiLU-403                  [-1, 384]               0
          Linear-404                 [-1, 1536]         591,360
         Sigmoid-405                 [-1, 1536]               0
         SEBlock-406           [-1, 1536, 7, 7]               0
          Conv2d-407            [-1, 256, 7, 7]         393,216
     BatchNorm2d-408            [-1, 256, 7, 7]             512
        Identity-409            [-1, 256, 7, 7]               0
     MBConvBlock-410            [-1, 256, 7, 7]               0
          Conv2d-411           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-412           [-1, 1536, 7, 7]           3,072
            SiLU-413           [-1, 1536, 7, 7]               0
          Conv2d-414           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-415           [-1, 1536, 7, 7]           3,072
            SiLU-416           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-417           [-1, 1536, 1, 1]               0
          Linear-418                  [-1, 384]         590,208
            SiLU-419                  [-1, 384]               0
          Linear-420                 [-1, 1536]         591,360
         Sigmoid-421                 [-1, 1536]               0
         SEBlock-422           [-1, 1536, 7, 7]               0
          Conv2d-423            [-1, 256, 7, 7]         393,216
     BatchNorm2d-424            [-1, 256, 7, 7]             512
        Identity-425            [-1, 256, 7, 7]               0
     MBConvBlock-426            [-1, 256, 7, 7]               0
          Conv2d-427           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-428           [-1, 1536, 7, 7]           3,072
            SiLU-429           [-1, 1536, 7, 7]               0
          Conv2d-430           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-431           [-1, 1536, 7, 7]           3,072
            SiLU-432           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-433           [-1, 1536, 1, 1]               0
          Linear-434                  [-1, 384]         590,208
            SiLU-435                  [-1, 384]               0
          Linear-436                 [-1, 1536]         591,360
         Sigmoid-437                 [-1, 1536]               0
         SEBlock-438           [-1, 1536, 7, 7]               0
          Conv2d-439            [-1, 256, 7, 7]         393,216
     BatchNorm2d-440            [-1, 256, 7, 7]             512
        Identity-441            [-1, 256, 7, 7]               0
     MBConvBlock-442            [-1, 256, 7, 7]               0
          Conv2d-443           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-444           [-1, 1536, 7, 7]           3,072
            SiLU-445           [-1, 1536, 7, 7]               0
          Conv2d-446           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-447           [-1, 1536, 7, 7]           3,072
            SiLU-448           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-449           [-1, 1536, 1, 1]               0
          Linear-450                  [-1, 384]         590,208
            SiLU-451                  [-1, 384]               0
          Linear-452                 [-1, 1536]         591,360
         Sigmoid-453                 [-1, 1536]               0
         SEBlock-454           [-1, 1536, 7, 7]               0
          Conv2d-455            [-1, 256, 7, 7]         393,216
     BatchNorm2d-456            [-1, 256, 7, 7]             512
        Identity-457            [-1, 256, 7, 7]               0
     MBConvBlock-458            [-1, 256, 7, 7]               0
          Conv2d-459           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-460           [-1, 1536, 7, 7]           3,072
            SiLU-461           [-1, 1536, 7, 7]               0
          Conv2d-462           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-463           [-1, 1536, 7, 7]           3,072
            SiLU-464           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-465           [-1, 1536, 1, 1]               0
          Linear-466                  [-1, 384]         590,208
            SiLU-467                  [-1, 384]               0
          Linear-468                 [-1, 1536]         591,360
         Sigmoid-469                 [-1, 1536]               0
         SEBlock-470           [-1, 1536, 7, 7]               0
          Conv2d-471            [-1, 256, 7, 7]         393,216
     BatchNorm2d-472            [-1, 256, 7, 7]             512
        Identity-473            [-1, 256, 7, 7]               0
     MBConvBlock-474            [-1, 256, 7, 7]               0
          Conv2d-475           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-476           [-1, 1536, 7, 7]           3,072
            SiLU-477           [-1, 1536, 7, 7]               0
          Conv2d-478           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-479           [-1, 1536, 7, 7]           3,072
            SiLU-480           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-481           [-1, 1536, 1, 1]               0
          Linear-482                  [-1, 384]         590,208
            SiLU-483                  [-1, 384]               0
          Linear-484                 [-1, 1536]         591,360
         Sigmoid-485                 [-1, 1536]               0
         SEBlock-486           [-1, 1536, 7, 7]               0
          Conv2d-487            [-1, 256, 7, 7]         393,216
     BatchNorm2d-488            [-1, 256, 7, 7]             512
        Identity-489            [-1, 256, 7, 7]               0
     MBConvBlock-490            [-1, 256, 7, 7]               0
          Conv2d-491           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-492           [-1, 1536, 7, 7]           3,072
            SiLU-493           [-1, 1536, 7, 7]               0
          Conv2d-494           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-495           [-1, 1536, 7, 7]           3,072
            SiLU-496           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-497           [-1, 1536, 1, 1]               0
          Linear-498                  [-1, 384]         590,208
            SiLU-499                  [-1, 384]               0
          Linear-500                 [-1, 1536]         591,360
         Sigmoid-501                 [-1, 1536]               0
         SEBlock-502           [-1, 1536, 7, 7]               0
          Conv2d-503            [-1, 256, 7, 7]         393,216
     BatchNorm2d-504            [-1, 256, 7, 7]             512
        Identity-505            [-1, 256, 7, 7]               0
     MBConvBlock-506            [-1, 256, 7, 7]               0
          Conv2d-507           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-508           [-1, 1536, 7, 7]           3,072
            SiLU-509           [-1, 1536, 7, 7]               0
          Conv2d-510           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-511           [-1, 1536, 7, 7]           3,072
            SiLU-512           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-513           [-1, 1536, 1, 1]               0
          Linear-514                  [-1, 384]         590,208
            SiLU-515                  [-1, 384]               0
          Linear-516                 [-1, 1536]         591,360
         Sigmoid-517                 [-1, 1536]               0
         SEBlock-518           [-1, 1536, 7, 7]               0
          Conv2d-519            [-1, 256, 7, 7]         393,216
     BatchNorm2d-520            [-1, 256, 7, 7]             512
        Identity-521            [-1, 256, 7, 7]               0
     MBConvBlock-522            [-1, 256, 7, 7]               0
          Conv2d-523           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-524           [-1, 1536, 7, 7]           3,072
            SiLU-525           [-1, 1536, 7, 7]               0
          Conv2d-526           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-527           [-1, 1536, 7, 7]           3,072
            SiLU-528           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-529           [-1, 1536, 1, 1]               0
          Linear-530                  [-1, 384]         590,208
            SiLU-531                  [-1, 384]               0
          Linear-532                 [-1, 1536]         591,360
         Sigmoid-533                 [-1, 1536]               0
         SEBlock-534           [-1, 1536, 7, 7]               0
          Conv2d-535            [-1, 256, 7, 7]         393,216
     BatchNorm2d-536            [-1, 256, 7, 7]             512
        Identity-537            [-1, 256, 7, 7]               0
     MBConvBlock-538            [-1, 256, 7, 7]               0
          Conv2d-539           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-540           [-1, 1536, 7, 7]           3,072
            SiLU-541           [-1, 1536, 7, 7]               0
          Conv2d-542           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-543           [-1, 1536, 7, 7]           3,072
            SiLU-544           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-545           [-1, 1536, 1, 1]               0
          Linear-546                  [-1, 384]         590,208
            SiLU-547                  [-1, 384]               0
          Linear-548                 [-1, 1536]         591,360
         Sigmoid-549                 [-1, 1536]               0
         SEBlock-550           [-1, 1536, 7, 7]               0
          Conv2d-551            [-1, 256, 7, 7]         393,216
     BatchNorm2d-552            [-1, 256, 7, 7]             512
        Identity-553            [-1, 256, 7, 7]               0
     MBConvBlock-554            [-1, 256, 7, 7]               0
          Conv2d-555           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-556           [-1, 1536, 7, 7]           3,072
            SiLU-557           [-1, 1536, 7, 7]               0
          Conv2d-558           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-559           [-1, 1536, 7, 7]           3,072
            SiLU-560           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-561           [-1, 1536, 1, 1]               0
          Linear-562                  [-1, 384]         590,208
            SiLU-563                  [-1, 384]               0
          Linear-564                 [-1, 1536]         591,360
         Sigmoid-565                 [-1, 1536]               0
         SEBlock-566           [-1, 1536, 7, 7]               0
          Conv2d-567            [-1, 256, 7, 7]         393,216
     BatchNorm2d-568            [-1, 256, 7, 7]             512
        Identity-569            [-1, 256, 7, 7]               0
     MBConvBlock-570            [-1, 256, 7, 7]               0
          Conv2d-571           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-572           [-1, 1536, 7, 7]           3,072
            SiLU-573           [-1, 1536, 7, 7]               0
          Conv2d-574           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-575           [-1, 1536, 7, 7]           3,072
            SiLU-576           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-577           [-1, 1536, 1, 1]               0
          Linear-578                  [-1, 384]         590,208
            SiLU-579                  [-1, 384]               0
          Linear-580                 [-1, 1536]         591,360
         Sigmoid-581                 [-1, 1536]               0
         SEBlock-582           [-1, 1536, 7, 7]               0
          Conv2d-583            [-1, 256, 7, 7]         393,216
     BatchNorm2d-584            [-1, 256, 7, 7]             512
        Identity-585            [-1, 256, 7, 7]               0
     MBConvBlock-586            [-1, 256, 7, 7]               0
          Conv2d-587           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-588           [-1, 1536, 7, 7]           3,072
            SiLU-589           [-1, 1536, 7, 7]               0
          Conv2d-590           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-591           [-1, 1536, 7, 7]           3,072
            SiLU-592           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-593           [-1, 1536, 1, 1]               0
          Linear-594                  [-1, 384]         590,208
            SiLU-595                  [-1, 384]               0
          Linear-596                 [-1, 1536]         591,360
         Sigmoid-597                 [-1, 1536]               0
         SEBlock-598           [-1, 1536, 7, 7]               0
          Conv2d-599            [-1, 256, 7, 7]         393,216
     BatchNorm2d-600            [-1, 256, 7, 7]             512
        Identity-601            [-1, 256, 7, 7]               0
     MBConvBlock-602            [-1, 256, 7, 7]               0
          Conv2d-603           [-1, 1536, 7, 7]         393,216
     BatchNorm2d-604           [-1, 1536, 7, 7]           3,072
            SiLU-605           [-1, 1536, 7, 7]               0
          Conv2d-606           [-1, 1536, 7, 7]          13,824
     BatchNorm2d-607           [-1, 1536, 7, 7]           3,072
            SiLU-608           [-1, 1536, 7, 7]               0
AdaptiveAvgPool2d-609           [-1, 1536, 1, 1]               0
          Linear-610                  [-1, 384]         590,208
            SiLU-611                  [-1, 384]               0
          Linear-612                 [-1, 1536]         591,360
         Sigmoid-613                 [-1, 1536]               0
         SEBlock-614           [-1, 1536, 7, 7]               0
          Conv2d-615            [-1, 256, 7, 7]         393,216
     BatchNorm2d-616            [-1, 256, 7, 7]             512
        Identity-617            [-1, 256, 7, 7]               0
     MBConvBlock-618            [-1, 256, 7, 7]               0
          Conv2d-619           [-1, 1280, 7, 7]         327,680
     BatchNorm2d-620           [-1, 1280, 7, 7]           2,560
            SiLU-621           [-1, 1280, 7, 7]               0
AdaptiveAvgPool2d-622           [-1, 1280, 1, 1]               0
          Linear-623                   [-1, 10]          12,810
================================================================
Total params: 38,433,414
Trainable params: 38,433,414
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 362.19
Params size (MB): 146.61
Estimated Total Size (MB): 509.37
----------------------------------------------------------------
None
